; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob40) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate11)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate9)
	(at pallet5 distributor2)
	(clear crate10)
	(at pallet6 depot1)
	(clear crate1)
	(at pallet7 distributor2)
	(clear crate8)
	(at pallet8 depot1)
	(clear crate5)
	(at pallet9 distributor0)
	(clear crate6)
	(at pallet10 depot1)
	(clear pallet10)
	(at truck0 distributor2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 326)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 202)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at hoist11 distributor1)
	(available hoist11)
	(at hoist12 distributor2)
	(available hoist12)
	(at crate0 distributor2)
	(on crate0 pallet7)
	(= (weight crate0) 47)
	(at crate1 depot1)
	(on crate1 pallet6)
	(= (weight crate1) 33)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(= (weight crate2) 90)
	(at crate3 distributor2)
	(on crate3 crate0)
	(= (weight crate3) 96)
	(at crate4 distributor2)
	(on crate4 crate3)
	(= (weight crate4) 32)
	(at crate5 depot1)
	(on crate5 pallet8)
	(= (weight crate5) 27)
	(at crate6 distributor0)
	(on crate6 pallet9)
	(= (weight crate6) 35)
	(at crate7 distributor2)
	(on crate7 crate2)
	(= (weight crate7) 61)
	(at crate8 distributor2)
	(on crate8 crate4)
	(= (weight crate8) 65)
	(at crate9 distributor1)
	(on crate9 pallet4)
	(= (weight crate9) 47)
	(at crate10 distributor2)
	(on crate10 crate7)
	(= (weight crate10) 95)
	(at crate11 depot2)
	(on crate11 pallet2)
	(= (weight crate11) 25)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet7)
		(on crate1 pallet10)
		(on crate2 pallet4)
		(on crate3 crate2)
		(on crate4 crate10)
		(on crate5 pallet0)
		(on crate6 pallet5)
		(on crate7 pallet8)
		(on crate8 crate5)
		(on crate10 pallet6)
		(on crate11 pallet1)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist3 crate6 pallet9 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist3) (on crate6 pallet9)
   added: (lifting hoist3 crate6) (clear pallet9)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 11
2. (lift hoist2 crate11 pallet2 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist2) (on crate11 pallet2)
   added: (lifting hoist2 crate11) (clear pallet2)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 11
3. (lift hoist10 crate8 crate4 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist10) (on crate8 crate4)
   added: (lifting hoist10 crate8) (clear crate4)
   changed: (fuel-cost) from 2 to 3
   goals met: 1 of 11
4. (load hoist10 crate8 truck0 distributor2)
   deleted: (lifting hoist10 crate8)
   added: (in crate8 truck0) (available hoist10)
   changed: (current_load truck0) from 0 to 65
   goals met: 1 of 11
5. (lift hoist5 crate4 crate3 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 crate3)
   added: (lifting hoist5 crate4) (clear crate3)
   changed: (fuel-cost) from 3 to 4
   goals met: 1 of 11
6. (lift hoist1 crate1 pallet6 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet6)
   added: (lifting hoist1 crate1) (clear pallet6)
   changed: (fuel-cost) from 4 to 5
   goals met: 1 of 11
7. (drop hoist1 crate1 pallet10 depot1)
   deleted: (lifting hoist1 crate1) (clear pallet10)
   added: (available hoist1) (at crate1 depot1) (clear crate1) (on crate1 pallet10)
   goals met: 2 of 11
8. (lift hoist11 crate9 pallet4 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist11) (on crate9 pallet4)
   added: (lifting hoist11 crate9) (clear pallet4)
   changed: (fuel-cost) from 5 to 6
   goals met: 2 of 11
9. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 6 to 16
   goals met: 2 of 11
10. (load hoist3 crate6 truck0 distributor0)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck0) (available hoist3)
   changed: (current_load truck0) from 65 to 100
   goals met: 2 of 11
11. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 16 to 26
   goals met: 2 of 11
12. (load hoist2 crate11 truck0 depot2)
   deleted: (lifting hoist2 crate11)
   added: (in crate11 truck0) (available hoist2)
   changed: (current_load truck0) from 100 to 125
   goals met: 2 of 11
13. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 26 to 36
   goals met: 2 of 11
14. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 36 to 46
   goals met: 2 of 11
15. (unload hoist1 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck0) from 125 to 60
   goals met: 2 of 11
16. (drop hoist1 crate8 crate5 depot1)
   deleted: (lifting hoist1 crate8) (clear crate5)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 crate5)
   goals met: 3 of 11
17. (unload hoist1 crate11 truck0 depot1)
   deleted: (in crate11 truck0) (available hoist1)
   added: (lifting hoist1 crate11)
   changed: (current_load truck0) from 60 to 35
   goals met: 3 of 11
18. (drop hoist1 crate11 pallet1 depot1)
   deleted: (lifting hoist1 crate11) (clear pallet1)
   added: (available hoist1) (at crate11 depot1) (clear crate11) (on crate11 pallet1)
   goals met: 4 of 11
19. (lift hoist10 crate10 crate7 distributor2)
   deleted: (at crate10 distributor2) (clear crate10) (available hoist10) (on crate10 crate7)
   added: (lifting hoist10 crate10) (clear crate7)
   changed: (fuel-cost) from 46 to 47
   goals met: 4 of 11
20. (drop hoist10 crate10 crate3 distributor2)
   deleted: (lifting hoist10 crate10) (clear crate3)
   added: (available hoist10) (at crate10 distributor2) (clear crate10) (on crate10 crate3)
   goals met: 4 of 11
21. (lift hoist10 crate7 crate2 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist10) (on crate7 crate2)
   added: (lifting hoist10 crate7) (clear crate2)
   changed: (fuel-cost) from 47 to 48
   goals met: 4 of 11
22. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 48 to 58
   goals met: 4 of 11
23. (load hoist10 crate7 truck0 distributor2)
   deleted: (lifting hoist10 crate7)
   added: (in crate7 truck0) (available hoist10)
   changed: (current_load truck0) from 35 to 96
   goals met: 4 of 11
24. (unload hoist10 crate6 truck0 distributor2)
   deleted: (in crate6 truck0) (available hoist10)
   added: (lifting hoist10 crate6)
   changed: (current_load truck0) from 96 to 61
   goals met: 4 of 11
25. (lift hoist12 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist12) (on crate2 pallet5)
   added: (lifting hoist12 crate2) (clear pallet5)
   changed: (fuel-cost) from 58 to 59
   goals met: 4 of 11
26. (drop hoist10 crate6 pallet5 distributor2)
   deleted: (lifting hoist10 crate6) (clear pallet5)
   added: (available hoist10) (at crate6 distributor2) (clear crate6) (on crate6 pallet5)
   goals met: 5 of 11
27. (lift hoist10 crate10 crate3 distributor2)
   deleted: (at crate10 distributor2) (clear crate10) (available hoist10) (on crate10 crate3)
   added: (lifting hoist10 crate10) (clear crate3)
   changed: (fuel-cost) from 59 to 60
   goals met: 5 of 11
28. (drop hoist12 crate2 crate6 distributor2)
   deleted: (lifting hoist12 crate2) (clear crate6)
   added: (available hoist12) (at crate2 distributor2) (clear crate2) (on crate2 crate6)
   goals met: 5 of 11
29. (lift hoist12 crate3 crate0 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist12) (on crate3 crate0)
   added: (lifting hoist12 crate3) (clear crate0)
   changed: (fuel-cost) from 60 to 61
   goals met: 5 of 11
30. (load hoist10 crate10 truck0 distributor2)
   deleted: (lifting hoist10 crate10)
   added: (in crate10 truck0) (available hoist10)
   changed: (current_load truck0) from 61 to 156
   goals met: 5 of 11
31. (load hoist5 crate4 truck0 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck0) (available hoist5)
   changed: (current_load truck0) from 156 to 188
   goals met: 5 of 11
32. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 61 to 71
   goals met: 5 of 11
33. (unload hoist1 crate10 truck0 depot1)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 188 to 93
   goals met: 5 of 11
34. (drop hoist1 crate10 pallet6 depot1)
   deleted: (lifting hoist1 crate10) (clear pallet6)
   added: (available hoist1) (at crate10 depot1) (clear crate10) (on crate10 pallet6)
   goals met: 6 of 11
35. (unload hoist1 crate4 truck0 depot1)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 93 to 61
   goals met: 6 of 11
36. (drop hoist1 crate4 crate10 depot1)
   deleted: (lifting hoist1 crate4) (clear crate10)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 crate10)
   goals met: 7 of 11
37. (lift hoist1 crate8 crate5 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 crate5)
   added: (lifting hoist1 crate8) (clear crate5)
   changed: (fuel-cost) from 71 to 72
   goals met: 6 of 11
38. (load hoist1 crate8 truck0 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 61 to 126
   goals met: 6 of 11
39. (lift hoist1 crate5 pallet8 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 pallet8)
   added: (lifting hoist1 crate5) (clear pallet8)
   changed: (fuel-cost) from 72 to 73
   goals met: 6 of 11
40. (load hoist1 crate5 truck0 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 126 to 153
   goals met: 6 of 11
41. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 73 to 83
   goals met: 6 of 11
42. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck0) from 153 to 126
   goals met: 6 of 11
43. (drop hoist0 crate5 pallet0 depot0)
   deleted: (lifting hoist0 crate5) (clear pallet0)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 pallet0)
   goals met: 7 of 11
44. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck0) from 126 to 61
   goals met: 7 of 11
45. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 83 to 93
   goals met: 7 of 11
46. (drop hoist0 crate8 crate5 depot0)
   deleted: (lifting hoist0 crate8) (clear crate5)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 crate5)
   goals met: 8 of 11
47. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 93 to 103
   goals met: 8 of 11
48. (unload hoist1 crate7 truck0 depot1)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 61 to 0
   goals met: 8 of 11
49. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 103 to 113
   goals met: 8 of 11
50. (drop hoist1 crate7 pallet8 depot1)
   deleted: (lifting hoist1 crate7) (clear pallet8)
   added: (available hoist1) (at crate7 depot1) (clear crate7) (on crate7 pallet8)
   goals met: 9 of 11
51. (lift hoist5 crate2 crate6 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 crate6)
   added: (lifting hoist5 crate2) (clear crate6)
   changed: (fuel-cost) from 113 to 114
   goals met: 9 of 11
52. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   changed: (current_load truck0) from 0 to 90
   goals met: 9 of 11
53. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 114 to 124
   goals met: 9 of 11
54. (unload hoist4 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist4)
   added: (lifting hoist4 crate2)
   changed: (current_load truck0) from 90 to 0
   goals met: 9 of 11
55. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 124 to 134
   goals met: 9 of 11
56. (drop hoist4 crate2 pallet4 distributor1)
   deleted: (lifting hoist4 crate2) (clear pallet4)
   added: (available hoist4) (at crate2 distributor1) (clear crate2) (on crate2 pallet4)
   goals met: 10 of 11
57. (load hoist12 crate3 truck0 distributor2)
   deleted: (lifting hoist12 crate3)
   added: (in crate3 truck0) (available hoist12)
   changed: (current_load truck0) from 0 to 96
   goals met: 10 of 11
58. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 134 to 144
   goals met: 10 of 11
59. (unload hoist4 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist4)
   added: (lifting hoist4 crate3)
   changed: (current_load truck0) from 96 to 0
   goals met: 10 of 11
60. (drop hoist4 crate3 crate2 distributor1)
   deleted: (lifting hoist4 crate3) (clear crate2)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 crate2)
   goals met: 11 of 11
